In [38]:
import pandas as pd
import numpy as np

Criando a base de dados

In [39]:
data_exem = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5),
                'data2' : np.random.randn(5)})

data_exem

  key1 key2     data1     data2
0    a  one  0.228874 -0.292836
1    a  two  0.985872 -0.202523
2    b  one -0.005796 -0.360655
3    b  two  1.715112  0.134639
4    a  one  1.134498  0.653421

Funções de agregação

split, apply, combine

GroupBy()

In [40]:
data_exem['data1'].groupby(data_exem['key2']).mean()

data_exem[['data1','data2']].groupby([data_exem['key1'], data_exem['key2']]).mean()

              data1     data2
key1 key2
a    one   0.681686  0.180293
     two   0.985872 -0.202523
b    one  -0.005796 -0.360655
     two   1.715112  0.134639

In [41]:
# separando os grupos

for name, group in data_exem.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.228874 -0.292836
1    a  two  0.985872 -0.202523
4    a  one  1.134498  0.653421
b
  key1 key2     data1     data2
2    b  one -0.005796 -0.360655
3    b  two  1.715112  0.134639

In [42]:
# separando por grupos e subgrupos

for (name1,name2), group in data_exem.groupby(['key1', 'key2']):
    print(name)
    print(group)

b
  key1 key2     data1     data2
0    a  one  0.228874 -0.292836
4    a  one  1.134498  0.653421
b
  key1 key2     data1     data2
1    a  two  0.985872 -0.202523
b
  key1 key2     data1     data2
2    b  one -0.005796 -0.360655
b
  key1 key2     data1     data2
3    b  two  1.715112  0.134639

In [43]:
#fazendo por pedaços

pedaco = dict(list(data_exem.groupby('key1')))
pedaco['a']

# data_exem.dtypes

  key1 key2     data1     data2
0    a  one  0.228874 -0.292836
1    a  two  0.985872 -0.202523
4    a  one  1.134498  0.653421

In [44]:
data_exem.groupby('key2')['data1'].mean()

key2
one    0.452525
two    1.350492
Name: data1, dtype: float64

In [45]:
# pode ser reescrita como 

data_exem.groupby('key1')[['data1','data2']].mean()

         data1     data2
key1
a     0.783082  0.052688
b     0.854658 -0.113008

In [68]:
 # autenticando api
 from kaggle.api.kaggle_api_extended import KaggleApi
 api = KaggleApi()
 api.authenticate()

 api.dataset_download_files('uciml/iris')

 from zipfile import ZipFile
 zf = ZipFile('/home/slraul/traning_projects/DS_with_Python/iris.zip', 'r')
zf.extractall('/home/slraul/traning_projects/DS_with_Python')
zf.close()

iris = pd.read_csv('Iris.csv', sep = ',')
iris.head()

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /home/slraul/.kaggle/kaggle.json'

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [70]:
# por coluna
iris.groupby('Species').var()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,212.5,0.124249,0.145180,0.030106,0.011494
Iris-versicolor,212.5,0.266433,0.098469,0.220816,0.039106
Iris-virginica,212.5,0.404343,0.104004,0.304588,0.075433